## Variables
1. **Date** -> Categorical,
2. **Flight Name** -> Categorical,
3. **Stops** -> Numerical,
4. **Price** -> Numerical,
5. **Duration** -> Numerical,
6. **Departure Time** -> Categorical,
7. **Arrival Time** -> Categorical

# Possible cleaning
1. Converting Stops to numerical (replacing "direct" with 0 stops)
2. Extracting price (string) into numerical value 
3. Converting duration into hrs (1h 30m -> 1.5)

# Question
4. Only flights on 25th Dec have multiple stops, should I split those 2 flights lets say [SunExpress, Turkish Airlines] into another column with flight1, flight2

--
## Data Cleaning

In [ ]:
#load data from file

In [22]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from matplotlib.pyplot import figure

# Read in Data

In [23]:
data= pd.read_csv("/Users/harjappansingh/Documents/College/Junior Year/Data Science/CA 2/flight_details.csv")

In [24]:
# data.info()
# data.head()
# print(data.describe())

#Check data clean
print("Missing Values")
data.isnull().sum() #Clean data with no missing values

Missing Values

Date              0
Flight Name       0
Stops             0
Price             0
Duration          0
Departure-Time    0
Arrival-Time      0
dtype: int64

 0   Date            1480 non-null   object
 1   Flight Name     1480 non-null   object
 2   Stops           1480 non-null   object
 3   Price           1480 non-null   object
 4   Duration        1480 non-null   object
 5   Departure-Time  1480 non-null   object
 6   Arrival-Time    1480 non-null   object

In [25]:
len(data. index)

1480

1. Deleting duplicate values

In [26]:
data = data.drop_duplicates()

In [27]:
len(data. index)

1455

1. Change date to categorcial
Date is currently in object format, so convert it to datetime format.

In [29]:

data['Date'] = pd.to_datetime(data['Date'], dayfirst=True, format='mixed')

data.info()
data.head()

<class 'pandas.core.frame.DataFrame'>
Index: 1455 entries, 0 to 1479
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            1455 non-null   datetime64[ns]
 1   Flight Name     1455 non-null   object
 2   Stops           1455 non-null   object
 3   Price           1455 non-null   object
 4   Duration        1455 non-null   object
 5   Departure-Time  1455 non-null   object
 6   Arrival-Time    1455 non-null   object
dtypes: datetime64[ns](1), object(6)
memory usage: 90.9+ KB

,Date,Flight Name,Stops,Price,Duration,Departure-Time,Arrival-Time
0,2024-10-30,"Aer Lingus, Cathay Pacific",2 stops,€893,40h 35m,17:15,20:50+2
2,2024-10-30,SWISS,2 stops,"€1,322",25h 35m,18:40,07:15+2
3,2024-10-30,Qantas Airways,1 stop,"€1,839",23h 10m,20:50,07:00+2
4,2024-10-30,Air France,2 stops,"€1,163",33h 55m,16:40,13:35+2
5,2024-10-30,Lufthansa,2 stops,"€1,347",26h 50m,17:25,07:15+2

2. Step 2: Split 'Flight Name' column into separate columns for each airline

If there are multiple airlines in a single entry (e.g., "Lufthansa, Qantas Airways"), we split them into separate columns.

In [31]:
flight_split = data['Flight Name'].str.split(',', expand=True)
# Rename columns based on the number of splits generated
flight_split.columns = [f'Airline_{i+1}' for i in range(flight_split.shape[1])]
data = pd.concat([data, flight_split], axis=1)

data.info()
data.head()

<class 'pandas.core.frame.DataFrame'>
Index: 1455 entries, 0 to 1479
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            1455 non-null   datetime64[ns]
 1   Flight Name     1455 non-null   object
 2   Stops           1455 non-null   object
 3   Price           1455 non-null   object
 4   Duration        1455 non-null   object
 5   Departure-Time  1455 non-null   object
 6   Arrival-Time    1455 non-null   object
 7   Airline_1       1455 non-null   object
 8   Airline_2       421 non-null    object
dtypes: datetime64[ns](1), object(8)
memory usage: 113.7+ KB

,Date,Flight Name,Stops,Price,Duration,Departure-Time,Arrival-Time,Airline_1,Airline_2
0,2024-10-30,"Aer Lingus, Cathay Pacific",2 stops,€893,40h 35m,17:15,20:50+2,Aer Lingus,Cathay Pacific
2,2024-10-30,SWISS,2 stops,"€1,322",25h 35m,18:40,07:15+2,SWISS,None
3,2024-10-30,Qantas Airways,1 stop,"€1,839",23h 10m,20:50,07:00+2,Qantas Airways,None
4,2024-10-30,Air France,2 stops,"€1,163",33h 55m,16:40,13:35+2,Air France,None
5,2024-10-30,Lufthansa,2 stops,"€1,347",26h 50m,17:25,07:15+2,Lufthansa,None


# Step 3: Convert 'Stops' column to a numerical value
# ---------------------------------------------------
# Extract the number of stops from the 'Stops' column, converting text like "2 stops" to the integer 2.
# This also converts the column to int type.

In [32]:
data['Stops'] = data['Stops'].str.extract(r'(\d+)').astype(int)
data.info()
data.head()

<class 'pandas.core.frame.DataFrame'>
Index: 1455 entries, 0 to 1479
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            1455 non-null   datetime64[ns]
 1   Flight Name     1455 non-null   object
 2   Stops           1455 non-null   int64
 3   Price           1455 non-null   object
 4   Duration        1455 non-null   object
 5   Departure-Time  1455 non-null   object
 6   Arrival-Time    1455 non-null   object
 7   Airline_1       1455 non-null   object
 8   Airline_2       421 non-null    object
dtypes: datetime64[ns](1), int64(1), object(7)
memory usage: 113.7+ KB

,Date,Flight Name,Stops,Price,Duration,Departure-Time,Arrival-Time,Airline_1,Airline_2
0,2024-10-30,"Aer Lingus, Cathay Pacific",2,€893,40h 35m,17:15,20:50+2,Aer Lingus,Cathay Pacific
2,2024-10-30,SWISS,2,"€1,322",25h 35m,18:40,07:15+2,SWISS,None
3,2024-10-30,Qantas Airways,1,"€1,839",23h 10m,20:50,07:00+2,Qantas Airways,None
4,2024-10-30,Air France,2,"€1,163",33h 55m,16:40,13:35+2,Air France,None
5,2024-10-30,Lufthansa,2,"€1,347",26h 50m,17:25,07:15+2,Lufthansa,None

# Step 4: Clean the 'Price' column to retain only numeric values
# --------------------------------------------------------------
# Strip out any non-numeric symbols from 'Price', leaving only the price as a float.

In [33]:
data['Price'] = data['Price'].replace('[^0-9]', '', regex=True).astype(float)
data.info()
data.head()

<class 'pandas.core.frame.DataFrame'>
Index: 1455 entries, 0 to 1479
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            1455 non-null   datetime64[ns]
 1   Flight Name     1455 non-null   object
 2   Stops           1455 non-null   int64
 3   Price           1455 non-null   float64
 4   Duration        1455 non-null   object
 5   Departure-Time  1455 non-null   object
 6   Arrival-Time    1455 non-null   object
 7   Airline_1       1455 non-null   object
 8   Airline_2       421 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(1), object(6)
memory usage: 113.7+ KB

,Date,Flight Name,Stops,Price,Duration,Departure-Time,Arrival-Time,Airline_1,Airline_2
0,2024-10-30,"Aer Lingus, Cathay Pacific",2,893.0,40h 35m,17:15,20:50+2,Aer Lingus,Cathay Pacific
2,2024-10-30,SWISS,2,1322.0,25h 35m,18:40,07:15+2,SWISS,None
3,2024-10-30,Qantas Airways,1,1839.0,23h 10m,20:50,07:00+2,Qantas Airways,None
4,2024-10-30,Air France,2,1163.0,33h 55m,16:40,13:35+2,Air France,None
5,2024-10-30,Lufthansa,2,1347.0,26h 50m,17:25,07:15+2,Lufthansa,None

# Step 5: Extract hours and minutes from 'Duration'
# -------------------------------------------------
# Split the duration into hours and minutes, converting them to floats.

In [35]:
# Step 5.1: Extract hours and minutes using regex
data['Duration_hours'] = data['Duration'].str.extract('(\d+)h').astype(float)
data['Duration_minutes'] = data['Duration'].str.extract('(\d+)m').astype(float)

# Step 5.2: Fill any NaN values with 0 (in case there are durations like "1h" with no minutes)
data['Duration_hours'].fillna(0, inplace=True)
data['Duration_minutes'].fillna(0, inplace=True)

# Step 5.3: Calculate total duration in minutes
data['Duration'] = (data['Duration_hours'] * 60) + data['Duration_minutes']

# Step 5.4: Drop the temporary hour and minute columns as they're now combined in 'Duration'
data = data.drop(['Duration_hours', 'Duration_minutes'], axis=1)

data.info()
data.head()

<class 'pandas.core.frame.DataFrame'>
Index: 1455 entries, 0 to 1479
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            1455 non-null   datetime64[ns]
 1   Flight Name     1455 non-null   object
 2   Stops           1455 non-null   int64
 3   Price           1455 non-null   float64
 4   Duration        1455 non-null   float64
 5   Departure-Time  1455 non-null   object
 6   Arrival-Time    1455 non-null   object
 7   Airline_1       1455 non-null   object
 8   Airline_2       421 non-null    object
dtypes: datetime64[ns](1), float64(2), int64(1), object(5)
memory usage: 113.7+ KB

<>:2: SyntaxWarning: invalid escape sequence '\d'
<>:3: SyntaxWarning: invalid escape sequence '\d'
<>:2: SyntaxWarning: invalid escape sequence '\d'
<>:3: SyntaxWarning: invalid escape sequence '\d'
/var/folders/78/z9k_q32d22b1hktwmj7nv48h0000gn/T/ipykernel_86268/3004039754.py:2: SyntaxWarning: invalid escape sequence '\d'
  data['Duration_hours'] = data['Duration'].str.extract('(\d+)h').astype(float)
/var/folders/78/z9k_q32d22b1hktwmj7nv48h0000gn/T/ipykernel_86268/3004039754.py:3: SyntaxWarning: invalid escape sequence '\d'
  data['Duration_minutes'] = data['Duration'].str.extract('(\d+)m').astype(float)
/var/folders/78/z9k_q32d22b1hktwmj7nv48h0000gn/T/ipykernel_86268/3004039754.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Duration_hours'].fillna(0, inplace=True)
/var/folders/78/z9k_q32d22b1hktwmj7nv48h0000gn/T/ipykernel_86268/3004039754.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Duration_minutes'].fillna(0, inplace=True)

,Date,Flight Name,Stops,Price,Duration,Departure-Time,Arrival-Time,Airline_1,Airline_2
0,2024-10-30,"Aer Lingus, Cathay Pacific",2,893.0,2435.0,17:15,20:50+2,Aer Lingus,Cathay Pacific
2,2024-10-30,SWISS,2,1322.0,1535.0,18:40,07:15+2,SWISS,None
3,2024-10-30,Qantas Airways,1,1839.0,1390.0,20:50,07:00+2,Qantas Airways,None
4,2024-10-30,Air France,2,1163.0,2035.0,16:40,13:35+2,Air France,None
5,2024-10-30,Lufthansa,2,1347.0,1610.0,17:25,07:15+2,Lufthansa,None

# Step 6: Convert 'Departure-Time' and 'Arrival-Time' to datetime format
# ----------------------------------------------------------------------
# Since we have date information, we can combine it with the times for better processing.
# First, strip any timezone or additional days info from time columns.

# Ensure that additional day info (like "+2") is removed from 'Arrival-Time'

In [36]:
data['Departure-Time'] = pd.to_datetime(data['Date'].astype(str) + ' ' + data['Departure-Time'])
data['Arrival-Time'] = data['Arrival-Time'].str.replace(r'\+\d', '', regex=True)
data['Arrival-Time'] = pd.to_datetime(data['Date'].astype(str) + ' ' + data['Arrival-Time'])

In [37]:
# Display the cleaned data
data.info()
data.head()

<class 'pandas.core.frame.DataFrame'>
Index: 1455 entries, 0 to 1479
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            1455 non-null   datetime64[ns]
 1   Flight Name     1455 non-null   object
 2   Stops           1455 non-null   int64
 3   Price           1455 non-null   float64
 4   Duration        1455 non-null   float64
 5   Departure-Time  1455 non-null   datetime64[ns]
 6   Arrival-Time    1455 non-null   datetime64[ns]
 7   Airline_1       1455 non-null   object
 8   Airline_2       421 non-null    object
dtypes: datetime64[ns](3), float64(2), int64(1), object(3)
memory usage: 113.7+ KB

,Date,Flight Name,Stops,Price,Duration,Departure-Time,Arrival-Time,Airline_1,Airline_2
0,2024-10-30,"Aer Lingus, Cathay Pacific",2,893.0,2435.0,2024-10-30 17:15:00,2024-10-30 20:50:00,Aer Lingus,Cathay Pacific
2,2024-10-30,SWISS,2,1322.0,1535.0,2024-10-30 18:40:00,2024-10-30 07:15:00,SWISS,None
3,2024-10-30,Qantas Airways,1,1839.0,1390.0,2024-10-30 20:50:00,2024-10-30 07:00:00,Qantas Airways,None
4,2024-10-30,Air France,2,1163.0,2035.0,2024-10-30 16:40:00,2024-10-30 13:35:00,Air France,None
5,2024-10-30,Lufthansa,2,1347.0,1610.0,2024-10-30 17:25:00,2024-10-30 07:15:00,Lufthansa,None